# RoofType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RoofBase..::..RoofType Property
RoofBase Class See Also
---
Retrieve or set the Type.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public RoofType RoofType { get; set; }
```

Visual Basic
---
```text
Public Property RoofType As RoofType
	Get
	Set
```

Visual C++
---
```text
public:
property RoofType^ RoofType {
	RoofType^ get ();
	void set (RoofType^ value);
}
```

# See Also
RoofBase Class
Autodesk.Revit.DB Namespace